{
    "errors": [
        {
            "code" : 10,
            "internalMessage": "Cannot complete the request because the request payload is invalid."
        },{
            "code" : 11,
            "message": "The email provided is used by another account, please try a different email.",
            "internalMessage": "Cannot create an Account because that email is in use by an existing Account."
        },{
            "code" : 12,
            "internalMessage": "Cannot complete the request because the session is invalid or has expired."
        },{
            "code" : 13,
            "internalMessage": "Cannot edit Account because the Account does not exist."
        },{
            "code" : 14,
            "internalMessage": "Cannot delete Account because the Account does not exist."
        },{
            "code" : 15,
            "message": "Your password is incorrect, please try again.",
            "internalMessage": "Cannot delete Account because the password provided for the Account is incorrect."
        },{
            "code" : 20,
            "message": "Your account is not yet activated, please check your inbox for an activation email.",
            "internalMessage": "Cannot create a session because the Account is not activated."
        },{
            "code" : 21,
            "message": "The email and password combination provided is incorrect, please try again",
            "internalMessage": "Cannot create a session because the password provided for the Account is incorrect."
        },{
            "code" : 22,
            "message": "The email and password combination provided is incorrect, please try again.",
            "internalMessage": "Cannot create a session because the Account does not exist."
        },{
            "code" : 30,
            "internalMessage": "Cannot send reset password email because an Account with that email does not exist."
        },{
            "code" : 31,
            "message": "Your password reset link has expired, please obtain another link from a new email.",
            "internalMessage": "Cannot reset Account's password because the token provided is invalid or has expired."
        },{
            "code" : 32,
            "internalMessage": "Cannot reset Account's password because the Account is not activated."
        },{
            "code" : 40,
            "internalMessage": "Cannot send activation email because an Account with that email is already activated."
        },{
            "code" : 41,
            "internalMessage": "Cannot send activation email because an Account with that email does not exist."
        },{
            "code" : 42,
            "internalMessage": "Cannot activate Account because the token provided is invalid."
        }
    ]
}
